In [2]:
import pandas as pd

In [35]:
df = pd.read_csv("oscar_age_female.csv")

In [54]:
df[df["Age"] == 42]

,Index,Year,Age,Name,Movie,Movie_2
47,48,1975,42,"""Ellen Burstyn""","""Alice Doesn't Live Here Anymore""\t",NaN
63,64,1991,42,"""Kathy Bates""","""Misery""",NaN

In [50]:
df.head()

,Index,Year,Age,Name,Movie,Movie_2
0,1,1928,22,"""Janet Gaynor""","""Seventh Heaven","Street Angel and Sunrise: A Song of Two Humans"""
1,2,1929,37,"""Mary Pickford""","""Coquette""",NaN
2,3,1930,28,"""Norma Shearer""","""The Divorcee""\t",NaN
3,4,1931,63,"""Marie Dressler""","""Min and Bill""",NaN
4,5,1932,32,"""Helen Hayes""","""The Sin of Madelon Claudet""\t",NaN

In [51]:
df.tail()

    Index  Year  Age                  Name                       Movie Movie_2
84     85  2012   62        "Meryl Streep"             "The Iron Lady"     NaN
85     86  2013   22   "Jennifer Lawrence"   "Silver Linings Playbook"     NaN
86     87  2014   44      "Cate Blanchett"              "Blue Jasmine"     NaN
87     88  2015   54      "Julianne Moore"               "Still Alice"     NaN
88     89  2016   26         "Brie Larson"                      "Room"     NaN

In [52]:
df["Age"]

0     22
1     37
2     28
3     63
4     32
      ..
84    62
85    22
86    44
87    54
88    26
Name: Age, Length: 89, dtype: int64

In [55]:
df["Name"]

0           "Janet Gaynor"
1          "Mary Pickford"
2          "Norma Shearer"
3         "Marie Dressler"
4            "Helen Hayes"
              ...
84          "Meryl Streep"
85     "Jennifer Lawrence"
86        "Cate Blanchett"
87        "Julianne Moore"
88           "Brie Larson"
Name: Name, Length: 89, dtype: object

In [63]:
df["Movie"]

0                     "Seventh Heaven
1                          "Coquette"
2                    "The Divorcee"\t
3                      "Min and Bill"
4      "The Sin of Madelon Claudet"\t
                   ...
84                    "The Iron Lady"
85          "Silver Linings Playbook"
86                     "Blue Jasmine"
87                      "Still Alice"
88                             "Room"
Name: Movie, Length: 89, dtype: object

In [86]:
df[df["Name"].replace('"').str.strip() == '"Janet Gaynor"']

Empty DataFrame
Columns: [Index, Year, Age, Name, Movie, Movie_2]
Index: []

0           "Janet Gaynor"
1          "Mary Pickford"
2          "Norma Shearer"
3         "Marie Dressler"
4            "Helen Hayes"
              ...
84          "Meryl Streep"
85     "Jennifer Lawrence"
86        "Cate Blanchett"
87        "Julianne Moore"
88           "Brie Larson"
Name: Name, Length: 89, dtype: object

Empty DataFrame
Columns: [Index, Year, Age, Name, Movie, Movie_2]
Index: []